In [ ]:
!pip install cx_oracle

In [1]:
import cx_Oracle
import pandas as pd
db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from BOOK")
x = cursor.fetchall()
df = pd.DataFrame(x)
df.head()

   0        1      2      3
0  1   축구의 역사   굿스포츠   7000
1  2  축구아는 여자    나무수  13000
2  3   축구의 이해  대한미디어  22000
3  4   골프 바이블  대한미디어  35000
4  5    피겨 교본   굿스포츠   8000

In [2]:
db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from BOOK")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'BOOK'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

   BOOKID BOOKNAME PUBLISHER  PRICE
0       1   축구의 역사      굿스포츠   7000
1       2  축구아는 여자       나무수  13000
2       3   축구의 이해     대한미디어  22000
3       4   골프 바이블     대한미디어  35000
4       5    피겨 교본      굿스포츠   8000

In [4]:
col_new = []
for i in col:
    for j in i:
        col_new.append(j)
col_new

['BOOKID', 'BOOKNAME', 'PUBLISHER', 'PRICE']

In [5]:
cursor.close()
db.close()

In [6]:
# Q. hr 사용자를 적용하면 원하는 테이블을 가져와서 df로 출력하세요(컬럼명 포함)
import cx_Oracle
import pandas as pd

#사용자명, 비번, host이름:포트/서비스이름
#db 들어가서 속성 누르면 나오는 정보들
#db연결 
db = cx_Oracle.connect('c##hr', 'hr', 'localhost:1521/xe')

cursor = db.cursor()
cursor.execute('select * from EMPLOYEES')
x = cursor.fetchall()
df_hr = pd.DataFrame(x)

cursor.execute("select column_name from user_tab_columns where table_name ='EMPLOYEES'")
col = cursor.fetchall()

col_new = [j for i in col for j in i]
df_hr.columns = col_new
h
df_r.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0

In [7]:
cursor.close()
db.close()

In [14]:
# create, insert
import cx_Oracle
db = cx_Oracle.connect("c##madang","madang","localhost:1521/xe")
cursor = db.cursor()
cursor.execute("create table sample2(id number)")
cursor.execute("insert into sample2(id) values(1)")
db.commit()

In [26]:
import cx_Oracle
db = cx_Oracle.connect("c##madang","madang","localhost:1521/xe")
cursor = db.cursor()
cursor.execute("create table sample(id number, data varchar2(20))")
db.commit()

In [30]:
import cx_Oracle
import pandas as pd
db = cx_Oracle.connect("c##madang","madang","localhost:1521/xe")
cursor = db.cursor()

rows = [ (1, "First" ), (2, "Second" ),
         (3, "Third" ), (4, "Fourth" ),
         (5, "Fifth" ), (6, "Sixth" ),
         (7, "Seventh" ) ]

cursor.executemany("insert into sample (id, data) values (:1,:2)",rows)
cursor.close()

db.commit()
db.close()

In [35]:
db = cx_Oracle.connect("c##madang","madang","localhost:1521/xe")
cursor = db.cursor()
cursor.execute('select * from sample')
x = cursor.fetchall()
df_hr = pd.DataFrame(x)
df_hr.columns=['id','data']
df_hr

   id     data
0   1    First
1   2   Second
2   3    Third
3   4   Fourth
4   5    Fifth
5   6    Sixth
6   7  Seventh

In [15]:
db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from DEMO")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'DEMO'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

  CUSTNO GENDER    AGE AREA
0  00751      M  60세이상  100
1  00752      M  60세이상  440
2  00753      F  60세이상  060
3  00754      F  60세이상  055
4  00755      F  60세이상  100

In [16]:
df.shape

(19383, 4)

In [17]:
df.AGE.value_counts()

45세~49세    4082
40세~44세    3677
50세~54세    3114
35세~39세    2769
55세~59세    1774
30세~34세    1679
60세이상      1303
25세~29세     685
20세~24세     283
19세이하        17
Name: AGE, dtype: int64

In [18]:
df.AGE.unique()

array(['60세이상', '55세~59세', '50세~54세', '45세~49세', '40세~44세', '35세~39세',
       '30세~34세', '25세~29세', '20세~24세', '19세이하'], dtype=object)

In [19]:
cursor.close()
db.close()

In [20]:
db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from PRODCL")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'PRODCL'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

  ASSO  BCODE MCODE    SCODE   MCL   SCL
0    A      1  0101  A010101  일용잡화  위생세제
1    A      1  0101  A010102  일용잡화   휴지류
2    A      1  0101  A010103  일용잡화  뷰티상품
3    A      1  0101  A010104  일용잡화  일용잡화
4    A      1  0101  A010105  일용잡화  세트상품

In [23]:
df.ASSO.value_counts()

B    2624
C     987
A     630
D     145
Name: ASSO, dtype: int64

In [22]:
df.BCODE.unique()

array([ 1,  2,  3,  4,  9,  5,  6,  7,  8, 11, 12, 13, 14, 15, 16, 17, 18,
       19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 10,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 52, 53, 54, 55, 56, 57, 58, 59,
       60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 44, 45, 46,
       47, 48, 49, 50, 51, 89, 90, 91, 92, 74, 75, 76, 77, 78, 79, 80, 81,
       82, 83, 84, 85, 86, 87, 88], dtype=int64)

과제_1012_1 PURPRD 테이블을 가져와서 다음사항을 수행하세요
- pivot_table을 이용해서 고객번호별 대분류(상품)별 구매금액을 도출
- 고객별 구매관련 의미있는 인사이트를 뽑아낼 수 있는 데이터 셋을 출력(2개 이상)